ServiceDesk/src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <resources>
    <name>Пятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ServiceDesk/src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
</mdclass:Enum>

ServiceDesk/src/InformationRegisters/ПроизводственныйКалендарь/ManagerModule.bsl
Функция ДанныеПроизводственногоКалендаря(ТекущийГод) Экспорт
	
	Запрос = Новый Запрос; 		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроизводственныйКалендарь.ДатаКалендаря,
	|	ПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|ГДЕ
	|	ПроизводственныйКалендарь.Год = &ТекущийГод";
	
	Запрос.УстановитьПараметр("ТекущийГод",	ТекущийГод);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЦветаОформленияВидовДнейПроизводственногоКалендаря() Экспорт
	
	ЦветаОформления = Новый Соответствие;
	
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий,			ЦветаСтиля.ВидДняПроизводственногоКалендаряРабочийЦвет);// Черный
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота,			ЦветаСтиля.ВидДняПроизводственногоКалендаряСубботаЦвет);// Темно-красный
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье,		ЦветаСтиля.ВидДняПроизводственногоКалендаряВоскресеньеЦвет); // Красный
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный,	ЦветаСтиля.ВидДняПроизводственногоКалендаряПредпраздничныйЦвет);  // Темно-синий
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник,			ЦветаСтиля.ВидДняПроизводственногоКалендаряПраздникЦвет); // Фиолетовый
	
	Возврат ЦветаОформления; 

КонецФункции
